from thread.publicFunc import *

box_df = readDataBase('光交箱')[['设施名称', '机房名称']]
oBox_df = readDataBase('分纤箱')[['设施名称', '机房名称']]
odf_df = readDataBase('ODF')[['设施名称', '机房名称']]
all_site_df = pd.concat([box_df, oBox_df, odf_df], axis=0)
all_site_df = all_site_df.ffill(axis=1)
site_dict = all_site_df.set_index('设施名称')['机房名称'].to_dict()
print(site_dict['麻章蓝天花园负一层新国标ODF04'])
# text = '湛江赤坎区农机总一楼机房无线1-OLT001-HW-MA5680T(湛江赤坎区农机总一楼机房无线1-OLT001-HW-MA5680T-0-6-H805GPBD-3-GPON)<==>湛江赤坎农机总ODF01(01-05-11)<瑞云北路与金康东路交界处576芯/GJ-湛江赤坎农机总ODF01(FX0011)>瑞云北路与金康东路交界处576芯/GJ(01-17-11)<==>瑞云北路与金康东路交界处576芯/GJ(01-09-09)<瑞云北路与金康东路交界处576芯/GJ-麻章工业品综合市场576芯/GJ01(FX0033)>麻章工业品综合市场576芯/GJ01(01-07-09)'
# obj_text = '育才路与金康东路交界处光交箱<={湛江麻章区坑排上村北ODF-ABB09-育才路与金康东路交界处光交箱/A}(7/24)=>湛江麻章区坑排上村北一楼机房传输1'
text = '湛江赤坎区农机总一楼机房无线1-OLT002-HW-MA5680T(湛江赤坎区农机总一楼机房无线1-OLT002-HW-MA5680T-0-4-H805GPFD-3-GPON)<==>湛江赤坎农机总ODF01(03-02-01)<湛江赤坎农机总ODF01-湛江麻章瑞云中ODF01(A03)(FX0085)>湛江麻章瑞云中ODF01(A03)(05-02-01)<==>湛江麻章瑞云中综合柜02(ODM03-01-4)<麻赤路与瑞云北路交界处一级光交箱-湛江麻章瑞云中综合柜02(FX0004)>麻赤路与瑞云北路交界处一级光交箱(C面-01-4)<==>麻赤路与瑞云北路交界处一级光交箱(B面-48-7)<麻赤路与瑞云北路交界处一级光交箱-麻章蓝天花园负一层新国标ODF04(FX0006)>麻章蓝天花园负一层新国标ODF04(01-03-07)<==>湛江麻章蓝天花园负一层新国标ODF04-POS001-1:4(湛江麻章蓝天花园负一层新国标ODF04-POS001-1:4-IN-01)'
obj_text = '湛江麻章区蓝天花园营销中心二楼机房用户1<={麻赤路与瑞云北路交界处一级光交箱-麻章蓝天花园负一层新国标ODF04}(13/23)=>麻赤路与瑞云北路交界处一级光交箱<={麻赤路与瑞云北路交界处一级光交箱-湛江麻章瑞云中综合柜02}(6/84)=>湛江麻章瑞云中八楼机房无线1'
print(findKeyPoint(text, obj_text, site_dict))